croghostrider/esp32_hd/main/hd_main.c
error_t readPZEM(int16_t* currV,int16_t* currP){
	// --------reading PZEM-----------
	if (PZEM_Version)  {
		if (!PZEMv30_updateValues()){
			*currV = -1;
			*currP = -1;
			return ESP_FAIL;
		}
	}
	*currV = PZEM_voltage();
	*currP = PZEM_power();
	if ((*currV<0) || (*currP<0)) {
		*currV = -1;
		*currP = -1;
		return ESP_FAIL;
	}
	return ESP_OK;
}

typedef struct {
	int16_t ticks;
	int16_t powerPrc;
} powerTable_t;

const powerTable_t pwrAngle[] = {
	{0,100},
	{150,98},
	{207,95},
	{265,90},
	{345,80},
	{461,60},
	{564,40},
	{680,20},
	{760,10},
	{817,5},
	{874, 2},
	{1024, 0}
};

#define ARR_SIZE (sizeof(pwrAngle)/sizeof(powerTable_t))

int powerPrcByHpoint(int hp){
	if (hp>=HMAX) return 0;
	if (hp<=0) return 100;
	int i;
	for (i=0;i<ARR_SIZE;i++)	if (hp<=pwrAngle[i].ticks) break;
	if (hp==pwrAngle[i].ticks) return pwrAngle[i].powerPrc;

	int tmp = (pwrAngle[i-1].powerPrc - pwrAngle[i].powerPrc);
	tmp = ((pwrAngle[i].ticks - pwrAngle[i-1].ticks)+tmp/2)/tmp;
	return (pwrAngle[i-1].powerPrc - ((hp - pwrAngle[i-1].ticks)+tmp/2)/tmp);
}

int hpointByPowerPrc(int prc){
	if (prc>=100) return 0;
	if (prc<=0) return HMAX;
	int i;
	for (i=0;i<ARR_SIZE;i++)	if (prc >= pwrAngle[i].powerPrc) break;
	if (prc==pwrAngle[i].powerPrc) return pwrAngle[i].ticks;

	int tmp = (pwrAngle[i-1].powerPrc - pwrAngle[i].powerPrc);
	tmp = ((pwrAngle[i].ticks - pwrAngle[i-1].ticks)+tmp/2)/tmp;
	return (pwrAngle[i].ticks - tmp*(prc - pwrAngle[i].powerPrc));
}

void pzem_task(void *arg)
{
	TickType_t overPowerAlarmTime;
	bool  flag_overPower=0;
	bool  pzem_ok;

	PZEM_init();

	zero_imp_shift = getIntParam(NET_PARAMS, "z_shift");

	vTaskDelay(1000/portTICK_PERIOD_MS);

	while(1) {
		vTaskDelay(1200/portTICK_PERIOD_MS);
		// --------reading PZEM-----------
		pzem_ok = (readPZEM(&CurVolts,&CurPower) == ESP_OK);
		//=========ALARMS CHECKS========
		//---- PZEM connection--------
		if (!pzem_ok) { // no connection to PZEM, alarm!
			SET_ALARM(ALARM_PZEM_ERR);
		}
		else
		{
			CLEAR_ALARM(ALARM_PZEM_ERR);
			//-------------- low voltage 220V----------
			if (CurVolts<10)
				SET_ALARM(ALARM_FREQ);
			else
				CLEAR_ALARM(ALARM_FREQ);
			//-------------- no payload ----------
			if ((SetPower > 0) && (CurPower<5)  &&	 (Hpoint<=TRIAC_GATE_MAX_CYCLES) ) {
				SET_ALARM(ALARM_NOLOAD);
			} else {
				CLEAR_ALARM(ALARM_NOLOAD);
			}

			//-------------- triac breakdown to a short circuit ----------
			if (((CurPower- SetPower)*100L/getIntParam(DEFL_PARAMS, "maxPower"))>DELTA_TRIAK_ALARM_PRC){
				ERR_MSG("triac breakdown times:%d",flag_overPower);
				//myBeep(true);
				if (!flag_overPower){  // first detection
					overPowerAlarmTime = xTaskGetTickCount () + SEC_TO_TICKS(TRIAK_ALARM_DELAY_SEC);// memorize event time (by ticks)
					flag_overPower = true;
				}
				else {
					if (xTaskGetTickCount () > overPowerAlarmTime){
						SET_ALARM(ALARM_OVER_POWER);
					}
				}
			}
			else {
				flag_overPower = false;
				CLEAR_ALARM(ALARM_OVER_POWER);
			}
		}

		//======
		if (SetPower) {
			if (MainMode == MODE_IDLE) setPower(0);	// turn off if Monitor Mode
			if (PROC_END == MainStatus) setPower(0); // turn off on EndProc stage
		}

		//======
		if ((SetPower <= 0) || EXISTS_ALARM(ALARM_FREQ | ALARM_NOLOAD | ALARM_PZEM_ERR | ALARM_TEMP | ALARM_SENSOR_ERR)) {
			//DBG("SetPower:%d  Alarm:%d",SetPower, AlarmMode);
			Hpoint = HMAX;
			continue;
		}

		// =============Power control=============
		int errP = CurPower-SetPower;
		int errPercent = abs((errP*100 + SetPower/2)/SetPower);

		if ((errP==0)||(errPercent==0)) { // precision is 1%
			//DBG("STABLE cur:%d(%d) errPrc:%d Hpoint:%d",CurPower,SetPower,errPercent,Hpoint);
			continue;
		}
		int voltagePower = powerPrcByHpoint(Hpoint);
		int increment=0,calcPowerPrc=0;
		if ((CurPower==0) || (voltagePower==0))
		{
			Hpoint = hpointByPowerPrc(powerPrcByHpoint(Hpoint)+5);
		}
		else	{ // CurPower>0
			//--- number real watts on one percent of the voltage power
			double WattsOn1PrcVoltagePwr =(double)(CurPower)/(double)(voltagePower);
			//DBG("WattsOn1PrcVoltagePwr:%4.1f",WattsOn1PrcVoltagePwr);
			int calcHpoint;

			if (errPercent>50){
				calcPowerPrc=(int)(0.5 + SetPower/WattsOn1PrcVoltagePwr);
			}
			else {
				calcPowerPrc = voltagePower + (int)(0.5 + errP/WattsOn1PrcVoltagePwr);
			}
			calcHpoint=hpointByPowerPrc(calcPowerPrc);
			increment = abs(Hpoint-calcHpoint);
			if (increment>1) 	increment = (increment +1)/2;
			if (!increment) increment=1;
			if (errP<0) increment=-abs(increment);

			Hpoint += increment;
			//zero_imp_shift = getIntParam(NET_PARAMS, "z_shift");
			//DBG("===zshift:%d max_hpoint:%d",zero_imp_shift, HMAX-zero_imp_shift);
			if (Hpoint >= (HMAX-zero_imp_shift) ) {
				Hpoint = (HMAX-zero_imp_shift);
			}
			if (Hpoint<zero_imp_shift) {
				Hpoint=zero_imp_shift;
			}
			//DBG("===set:%d cur:%d hp:%d inc:%d",SetPower, CurPower, Hpoint, increment);
		}// triac angle correction, as CurPower>0
	}//while(1)
}


const char *getMainModeStr(void)
{
	switch (MainMode) {
        case MODE_IDLE:	return "Монитор";
        case MODE_POWEERREG: return "Регулятор мощности";
	case MODE_DISTIL: return "Дистилляция";
	case MODE_RECTIFICATION: return "Ректификация";
	case MODE_TESTKLP: return "Тестирование клапанов";
	default: return "Неизвестно";
	}
}

const char *getMainStatusStr(void)
{
	switch (MainMode) {
    case MODE_IDLE:
	case MODE_TESTKLP:
		return "Ожидание команды";
	case MODE_POWEERREG:
		switch (MainStatus) {
		case PROC_START: return "Стабилизация мощности";
		}
	case MODE_DISTIL:
		switch (MainStatus) {
		case PROC_DISTILL: return "Дистилляция";
		}
	case MODE_RECTIFICATION:
		switch (MainStatus) {
		case START_WAIT: return "Ожидание запуска процесса";
		case PROC_START: return "Начало процесса";
		case PROC_RAZGON: return "Разгон";
		case PROC_STAB: return "Стабилизация Т колонны";
		case PROC_GLV: return "Отбор головных фракций";
		case PROC_T_WAIT: return "Рестабилизация по стопу";
		case PROC_SR: return "Отбор СР";
		case PROC_HV: return "Отбор хвостовых фракций";
		case PROC_WAITEND: return "Охлаждение куба";
		default: return "Процесс завершен";
		}
		break;
	default:
		return "Неизвестно";
	}

