croghostrider/esp32_hd/main/hd_main.c
}

const char *getAlarmModeStr(void)
{

	if (!AlarmMode) return NULL;

	static char str[256];
	int cnt;
	str[0]=0;
	//strcpy(str, "<b class=\"red\">");
	if (EXISTS_ALARM(ALARM_TEMP)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, "Превышение температуры", cnt);
	}
	if (EXISTS_ALARM(ALARM_WATER)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, " Нет охлаждения", cnt);
	}
	if (EXISTS_ALARM(ALARM_FREQ)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str, "Нет сети", cnt);
	}
	if (EXISTS_ALARM(ALARM_NOLOAD)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  Нет нагрузки", cnt);
	}
	if (EXISTS_ALARM(ALARM_EXT)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  аварийный датчик", cnt);
	}
	if (EXISTS_ALARM(ALARM_OVER_POWER)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  ВЫСОКАЯ МОЩНОСТЬ !", cnt);
	}
	if (EXISTS_ALARM(ALARM_PZEM_ERR)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  Ошибка PZEM!", cnt);
	}
	if (EXISTS_ALARM(ALARM_SENSOR_ERR)) {
		cnt = sizeof(str) - strlen(str);
		strncat(str,"  нет датчика температуры!", cnt);
	}
	//strcat(str,"</b>");
	return str;
}


// Получение строки о причине перезагрузки
const char *getResetReasonStr(void)
{

	switch (resetReason) {
        case POWERON_RESET: return "Vbat power on reset";
        case SW_RESET: return "Software reset digital core";
        case OWDT_RESET: return "Legacy watch dog reset digital core";
        case DEEPSLEEP_RESET: return "Deep Sleep reset digital core";
        case SDIO_RESET: return "Reset by SLC module, reset digital core";
        case TG0WDT_SYS_RESET: return "Timer Group0 Watch dog reset digital core";
        case TG1WDT_SYS_RESET: return "Timer Group1 Watch dog reset digital core";
        case RTCWDT_SYS_RESET: return "RTC Watch dog Reset digital core";
        case INTRUSION_RESET: return "Instrusion tested to reset CPU";
        case TGWDT_CPU_RESET: return "Time Group reset CPU";
        case SW_CPU_RESET: return "Software reset CPU";
        case RTCWDT_CPU_RESET: return "RTC Watch dog Reset CPU";
        case EXT_CPU_RESET: return "For APP CPU, reseted by PRO CPU";
        case RTCWDT_BROWN_OUT_RESET: return "Reset when the vdd voltage is not stable";
        case RTCWDT_RTC_RESET: return "RTC Watch dog reset digital core and rtc module";
	default: return "Uncnown reason";
	}
}

/* valve program PWM task  (one task for each valve)
 * @*arg is (int valve number)
 */
void valvePWMtask(void *arg){
	int num=(int)arg;
	TickType_t xLastWakeTime=xTaskGetTickCount ();

	DBGV("======started v:%d",num);
	while(1) {
		if (Klp[num].is_pwm) {
			DBGV("pwmON |%.1f sec|",Klp[num].open_time);
			if (Klp[num].open_time>0.1) { //do nothing if time is too small
				cmd2valve (num, cmd_open);				//turn-on valve
				vTaskDelayUntil( &xLastWakeTime, SEC_TO_TICKS(Klp[num].open_time));
			}

			if (Klp[num].is_pwm){
				DBGV("pwmOFF|%.1f sec|",Klp[num].close_time);
				if (Klp[num].close_time>0.2) { //if time less 0.2 sec do nothing
					cmd2valve (num, cmd_close); //turn-off valve
					vTaskDelayUntil( &xLastWakeTime, SEC_TO_TICKS(Klp[num].close_time));
				}
			}
		}

		if (! Klp[num].is_pwm)	{  // if no pwm
			DBGV("suspend v:%d",num);
			vTaskSuspend(NULL);	// stop the task (it will be resumed when pwm is turn-on in func startKlpPwm() )
			DBGV("resume  v:%d",num);
			xLastWakeTime = xTaskGetTickCount ();
		}
	}
}


void IRAM_ATTR timer0_group0_1ms_ISR(void *para)
{
	int timer_idx = (int) para;
	uint32_t intr_status = TIMERG0.int_st_timers.val;

	if (intr_status & BIT(timer_idx)) {

	        /*Timer will reload counter value*/
	        TIMERG0.hw_timer[timer_idx].update = 1;
		/*We don't call a API here because they are not declared with IRAM_ATTR*/
		TIMERG0.int_clr_timers.t1 = 1;
		/* For a auto-reload timer, we still need to set alarm_en bit if we want to enable alarm again.*/
		TIMERG0.hw_timer[timer_idx].config.alarm_en = 1;

		if (beepActive) {
			// Обработка пищалки
			beeperTime--;
			if (beeperTime <= 0) {
				beeperTime = 0;
				beepActive = false;
				GPIO_OFF(GPIO_BEEP);
				//GPIO.out_w1tc = (1 << GPIO_BEEP);
			}
		}	

		tic_counter++;
		if (tic_counter >= 1000) {
			tic_counter=0;
			uptime_counter++;
			if (rect_timer1>0) rect_timer1--; // Таймер для отсчета секунд 1
			else rect_timer1=0;
			if (timer_sec2>0) timer_sec2--;	// Таймер для отсчета секунд 2
			else timer_sec2=0;
			if (timer_sec3>0) timer_sec3--;	// Таймер для отсчета секунд 3
			else timer_sec3=0;
			CurFreq = gpio_counter;
			gpio_counter=0;
			//xQueueSendFromISR(timer_queue, &intr_status, NULL);
		}

	}
}

/**
 * Настройка аппаратного таймера генерировать прерывания раз в 1 милисекунду
 */
static void tg0_timer0_init()
{
	int timer_group = TIMER_GROUP_0;
	int timer_idx = TIMER_1;
	timer_config_t config;

	config.alarm_en = true;
	config.auto_reload = 1;
	config.counter_dir = TIMER_COUNT_UP;
	config.divider = TIMER_DIVIDER;
	config.intr_type = TIMER_INTR_LEVEL;
	config.counter_en = TIMER_PAUSE;

    /* Конфигурация таймера */
    timer_init(timer_group, timer_idx, &config);

    /* Ставим таймер на паузу */
    timer_pause(timer_group, timer_idx);

    /* Загружаем значение таймера */
    timer_set_counter_value(timer_group, timer_idx, 0);

    /*Set alarm value*/
    timer_set_alarm_value(timer_group, timer_idx, (TIMER_INTERVAL_SEC * TIMER_SCALE) - TIMER_FINE_ADJ);
    /* Разрешаем прерывания таймера */
    timer_enable_intr(timer_group, timer_idx);

    /* Устанавливаем обработчик прерывания */
    timer_isr_register(timer_group, timer_idx, timer0_group0_1ms_ISR, (void*) timer_idx, ESP_INTR_FLAG_IRAM, NULL);

    /* Запускаем таймер */
    timer_start(timer_group, timer_idx);
}

// ISR triggered by GPIO edge at the end of each Alternating Current half-cycle.
// Used to reset the PWM timer, which synchronize the TRIAC operation with
// the mains frequency.  Also used to perform fading of PWM phase.
void IRAM_ATTR gpio_isr_handler(void* arg) 
{ 
	uint32_t intr_st = GPIO.status;
	if (intr_st & (1 << GPIO_DETECT_ZERO)) { 			// если прерывание
		if (!(GPIO.in & (1 << GPIO_DETECT_ZERO))) {	// на выводе подключенном к детектору нуля сети

