croghostrider/esp32_hd/main/hd_main.c
			// обнуляем ШИМ-таймер включающий симистор
			LEDC.timer_group[0].timer[0].conf.rst = 1;
			LEDC.timer_group[0].timer[0].conf.rst = 0;
		
			// задаем ШИМ-таймеру уставку
			if (Hpoint >= MAX_HPOINT_VALUE) {
				// If hpoint if very close to the maximum value, ie mostly off, simply turn off 
				// the output to avoid glitch where hpoint exceeds duty. 
				LEDC.channel_group[0].channel[0].conf0.sig_out_en = 0; 
			} else { 
				LEDC.channel_group[0].channel[0].hpoint.hpoint = Hpoint; 
				LEDC.channel_group[0].channel[0].conf0.sig_out_en = 1; 
				LEDC.channel_group[0].channel[0].conf1.duty_start = 1; 
			}
			// увеличим счетчик срабатываний детектора нуля сети
			gpio_counter++;
		}
	} else if (intr_st & (1 << GPIO_ALARM)) { // прерывание от вывода "внешняя авария"
		// Авария от внешнего источника
		AlarmMode |= ALARM_EXT;
	}
	GPIO.status_w1tc = intr_st;
} 

/* Настройка и установка состояния GPIO для работы */
void setProcessGpio(int on)
{
	static char is_configured = 0;
	uint32_t pin_sel = 0;
	uint32_t gpio = getIntParam(DEFL_PARAMS, "processGpio");
	if (gpio <= 0 && gpio > 64)   return;

	pin_sel = 1<<gpio;

	if (!is_configured) {
		// Configure output gpio
		gpio_config_t io_conf;
		io_conf.intr_type = GPIO_PIN_INTR_DISABLE;
		io_conf.mode = GPIO_MODE_OUTPUT;
		io_conf.pin_bit_mask = pin_sel;
		io_conf.pull_down_en = 0;
		io_conf.pull_up_en = 0;
		gpio_config(&io_conf);
		is_configured++;
	}
	gpio_set_level(gpio, on);	

}

/* Загрузка и установка параметров работы */
int paramSetup(void)
{
	// Загрузка параметров
	if (param_load(DEFL_PARAMS, RECT_CONFIGURATION) < 0) {
		// Файл не найден - заполняем значениями по умолчанию
		return param_default(DEFL_PARAMS, RECT_CONFIGURATION);
	}
	return ESP_OK;
}

cJSON* getModeInfo(cJSON *j)
{
	cJSON *ja = j;
	if (! ja){
		ja = cJSON_CreateObject();
		cJSON_AddItemToObject(ja, "cmd", cJSON_CreateString("modeinfo"));
	}
	cJSON_AddItemToObject(ja, "MainMode", cJSON_CreateNumber(MainMode));
	cJSON_AddItemToObject(ja, "MainModeStr", cJSON_CreateString(getMainModeStr()));
	cJSON_AddItemToObject(ja, "MainStatus", cJSON_CreateNumber(MainStatus));
	cJSON_AddItemToObject(ja, "MainStatusStr", cJSON_CreateString(getMainStatusStr()));
	cJSON_AddItemToObject(ja, "waitStr", cJSON_CreateString(getWaitStr()));
	return ja;
}


cJSON* getInformation(void)
{
	char data[80];
	//const char *wo;
	cJSON *ja, *j;
	time_t CurrentTime;
	struct tm CurrentTm;

	CurrentTime = time(NULL);
	localtime_r(&CurrentTime, &CurrentTm);
	ja = cJSON_CreateObject();
	cJSON_AddItemToObject(ja, "cmd", cJSON_CreateString("info"));
	snprintf(data, sizeof(data)-1, "%02d:%02d", CurrentTm.tm_hour, CurrentTm.tm_min);
	cJSON_AddItemToObject(ja, "time", cJSON_CreateString(data));
	snprintf(data, sizeof(data)-1, "%02d:%02d:%02d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);

	getModeInfo(ja);

	cJSON_AddItemToObject(ja, "uptime", cJSON_CreateString(data));

	cJSON_AddItemToObject(ja, "CurVolts", cJSON_CreateNumber(CurVolts));
	cJSON_AddItemToObject(ja, "CurPower", cJSON_CreateNumber(CurPower));
	cJSON_AddItemToObject(ja, "SetPower", cJSON_CreateNumber(SetPower));
	cJSON_AddItemToObject(ja, "CurFreq", cJSON_CreateNumber(CurFreq/2));

	cJSON_AddItemToObject(ja, "Alarm", cJSON_CreateNumber(AlarmMode));
	if (getAlarmModeStr())	cJSON_AddItemToObject(ja, "AlarmMode", cJSON_CreateString(getAlarmModeStr()));
	cJSON_AddItemToObject(ja, "heap", cJSON_CreateNumber(esp_get_free_heap_size()));

	//------BMP180--------
	if (bmpTemperature > 0 && bmpTruePressure > 0) {
		cJSON_AddItemToObject(ja, "bmpTemperature", cJSON_CreateNumber(bmpTemperature));
		snprintf(data, sizeof(data)-1, "%0.2f", bmpTruePressure/133.332);
		cJSON_AddItemToObject(ja, "bmpTruePressure", cJSON_CreateString(data));
		cJSON_AddItemToObject(ja, "bmpPressurePa", cJSON_CreateNumber(bmpTruePressure));
	}

	//------ADC ads1015----------
	if (IS_ADS1015_PRESENT){
		j = cJSON_CreateArray();
		//TickType_t systime = xTaskGetTickCount ();
		for (int i=0; i<ADC_CHANNEL_COUNT; i++) {
			cJSON *jadc = cJSON_CreateObject();
			cJSON_AddItemToObject(jadc, "id", cJSON_CreateNumber(i));
			cJSON_AddItemToObject(jadc, "val", cJSON_CreateNumber(adc[i].last_val));
			cJSON_AddItemToArray(j, jadc);
		}
		cJSON_AddItemToObject(ja, "adc", j);
	}

	//------DS sensors------
	j = getDSjson();
	cJSON_AddItemToObject(ja, "sensors", j);
	//------Valves--
	j = cJSON_CreateArray();
	for (int i=0; i<MAX_KLP; i++) {
		cJSON_AddItemToArray(j, json_klp(i));
	}
	cJSON_AddItemToObject(ja, "klapans", j);

	if (MODE_RECTIFICATION == MainMode) {
		float timeStabKolonna= fabs(getFloatParam(DEFL_PARAMS, "timeStabKolonna"));
		// Режим ректификации
		switch (MainStatus) {
		  case PROC_STAB:
			  // TimeStab
				snprintf(data, sizeof(data)-1, "%02d/%02.0f sec", uptime_counter-secTempPrev, timeStabKolonna);
				cJSON_AddItemToObject(ja, "rect_time_stab", cJSON_CreateString(data));
				/* no break */
		  case PROC_GLV:
				// TemperatureStab
				//snprintf(data, sizeof(data)-1, "%02.1f C", tempStabSR);
				//cJSON_AddItemToObject(ja, "rect_t_stab", cJSON_CreateString(data));
				break;
		  case PROC_T_WAIT:
				snprintf(data, sizeof(data)-1, "%02d sec", rect_timer1);
				cJSON_AddItemToObject(ja, "rect_timer1", cJSON_CreateString(data));
				// delta TemperatureStab
				snprintf(data, sizeof(data)-1, "%02.1f <-- %02.1f C", tempStabSR, getTube20Temp());
				cJSON_AddItemToObject(ja, "rect_t_stab", cJSON_CreateString(data));
				break;
		  case PROC_SR:
				// TemperatureStab
				snprintf(data, sizeof(data)-1, "%02.1f C", tempStabSR);
				cJSON_AddItemToObject(ja, "rect_t_stab", cJSON_CreateString(data));
				// PWMsr
				cJSON_AddItemToObject(ja, "rect_p_shim", cJSON_CreateNumber(ProcChimSR));
				break;
		  default:
			  break;
		}
	}
	return ja;
}

// Установка рабочей мощности
void setPower(int16_t pw)
{
	int16_t mp;
	mp = getIntParam(DEFL_PARAMS, "maxPower");
	if (pw > mp) SetPower = mp;
	else SetPower = pw;

	if (pw > mp/2) {
		LEDC.channel_group[0].channel[0].duty.duty = (TRIAC_GATE_IMPULSE_CYCLES*3) << 4;
	} else {
		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	}

	if (pw>0) setProcessGpio(1);
	else setProcessGpio(0);

	if (nvsHandle) {
		nvs_set_i16(nvsHandle, "SetPower", SetPower);
	}
}                                                   

