croghostrider/esp32_hd/main/hd_main.c
		//------------- завершение---------------
		secTempPrev = uptime_counter;	// время, когда стабилизировалась температура
		DBG("T restored; go to SR. T:%0.2f", tempStabSR);
		set_status(PROC_SR);	// @suppress("No break at end of case") Переход к отбору продукта
        /* fall through */

	case PROC_SR:	// Отбор СР
		// старт
		if (prev_status!=MainStatus){
			if (prev_status!=PROC_T_WAIT) { // если не после рестабилизации
				openKlp(klp_water);		// Открытие клапана воды
				closeKlp(klp_glwhq); 		// Отключение клапана отбора голов/хвостов
				set_proc_power("powerRect");
			}
			int pwm=GetSrPWM();// PWM отбора (по-шпоре)
			DBG("pwm by shpora %d",pwm);
			setNewProcChimSR(pwm);
			int period=getIntParam(DEFL_PARAMS, "timeChimRectOtbSR");
			start_valve_PWMpercent	// включаем медленный ШИМ клапана продукта
			  ( klp_sr,
				period,// период ШИМ в сек
				ProcChimSR //%
			  );
			sprintf(b, "%02d:%02d:%02d тело, PWM:%d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60, ProcChimSR);
			send_message(b);
			if (tempStabSR <= 0) setTempStabSR(28.5);
			prev_status=MainStatus;
			LOG("PROC_SR  Tstab:%5.1f PWM:%d%%(%d sec)",tempStabSR,ProcChimSR,period);

			float tempEndRectOtbSR = getFloatParam(DEFL_PARAMS, "tempEndRectOtbSR");
			if (tempEndRectOtbSR>0)					// контроль по Т куба
				setWaitSensor(DS_CUB, tempEndRectOtbSR);
			else							// контроль по Т20
				setWaitSensor(DS_TUBE20, tempEndRectOtbSR);

		}

		//-----------контроль
		t = getTube20Temp(); // T низа колонны
		if (sensor_err(t)) break; // сбой датчика, ждем

		int minProcChimOtbSR = getIntParam(DEFL_PARAMS, "minProcChimOtbSR"); // минимальный % отбора

		if ((t>0)&&(t < tempStabSR)) {	//если температура стала ниже Т стабилизации,
			setTempStabSR(t);	// принимаем ее за новую Т стабилизации (ПБ)
		}
		float delta_limit = getFloatParam(DEFL_PARAMS, "tempDeltaRect");
		if ( t >= (tempStabSR + delta_limit) ) {	// Температура превысила Тстаб+дельта, переход на рестабилизацию
			LOG("STOP by delta:%5.2f(limit:%05.1f Tube20:%5.1f Tstb:%05.1f",(t-tempStabSR),delta_limit,t,tempStabSR);
			//-- вносим температуру стопа в таблицу самообучения
			int cntCHIM = getIntParam(DEFL_PARAMS, "cntCHIM");
			if (cntCHIM < 0) {
				// Запоминаем температуру, когда произошел стоп за вычетом 0.1 градуса.
				autoPWM[-cntCHIM].temp = t - 0.1;
				autoPWM[-cntCHIM].pwm = ProcChimSR;
				if (-cntCHIM < COUNT_PWM-1) cntCHIM--;
			}

			//-- уменьшаем % отбора по заданному декременту
			int decrementCHIM = getIntParam(DEFL_PARAMS, "decrementCHIM");
			int pwm_sr=ProcChimSR;
			if (decrementCHIM>=0) { // положительное значение: декремент в абсолютном значении процентов
				pwm_sr -= decrementCHIM; // вычтем из текущего %отбора
			} else {// отрицательное значение: декремент относительный, в процентах от текущего %та
				uint16_t v = (ProcChimSR * (-decrementCHIM) + 50)/100; // рассчитали величину декремента
				if (v<=0) v=1; 	// если декремент получился ноль, зададим 1
				pwm_sr -= v; 	// уменьшим % отбора на расчитанную величину
			}
			if (pwm_sr < minProcChimOtbSR)	pwm_sr = minProcChimOtbSR;
			LOG("dec PWM %d->%d",ProcChimSR,pwm_sr);
			if (ProcChimSR != pwm_sr)	{
				DBG("set dec pwm %d",pwm_sr);
				setNewProcChimSR(pwm_sr);
			}

			//-- переключение на рестабилизацию
			set_status(PROC_T_WAIT);
			if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
			DBG("Switch state to temperature re-stabilization.");
			break;
		}

		// -- автоувеличение % отбора - если меньше 100%
		if (ProcChimSR<100){
			int timeAutoIncCHIM = getIntParam(DEFL_PARAMS, "timeAutoIncCHIM");
			if ((timeAutoIncCHIM>0) && ((uptime_counter - secTempPrev) > timeAutoIncCHIM) ) {
				DBG("inc");
				if (ProcChimSR > minProcChimOtbSR) {	// Шим прибавляем только если не минимальный
					int incrementCHIM = getIntParam(DEFL_PARAMS, "incrementCHIM");
					int pwm=ProcChimSR;
					if (incrementCHIM>=0) {	// инкремент - абсолютное значение
						pwm += incrementCHIM;
					} else {								// инкремент - процент от текущих % отбора
						pwm +=  (ProcChimSR*(-incrementCHIM) + 50)/100;
						if (pwm == ProcChimSR) pwm++;
					}

					if (pwm>100) pwm=100;
					LOG("inc PWM %d->%d",ProcChimSR, pwm);

					setNewProcChimSR(pwm);
					//--- перезапускаем медленный ШИМ с новым % отбора
					start_valve_PWMpercent
					  ( klp_sr, // клапан продукта
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbSR"),// период ШИМ в сек
						ProcChimSR //%
					  );
					sprintf(b, "%02d:%02d:%02d тело:увеличение PWM:%d", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60, ProcChimSR);
					send_message(b);
				}
				secTempPrev = uptime_counter;
			} //auto-increment block
		} //pwm<100

		// проверим - можно ли продолжать отбор тела?
		if (! end_condition_SR())	{
			break;  // продолжаем отбор тела
		}
		// условия завершения отбора продукта выполнены

		//------------завершение тела------
		set_status(PROC_HV);			// Переход к отбору хвостов
		 /* fall through */

	case PROC_HV:	// Отбор хвостовых фракций
		// старт
		if (prev_status!=MainStatus){
			LOG("PROC_TAIL (till T cube:%5.1f)",getFloatParam(DEFL_PARAMS, "tempEndRect"));
			if (prev_status!=PROC_SR) { // если не после отбора тела
				openKlp(klp_water);		// Открытие клапана воды
				set_proc_power("powerRect");
			}
			closeKlp(klp_sr); 			// Отключение клапана продукта
			start_valve_PWMpercent(klp_glwhq,
						getFloatParam(DEFL_PARAMS, "timeChimRectOtbGlv"),
						100);
			prev_status=MainStatus;
			sprintf(b, "%02d:%02d:%02d хвосты до:%.1f", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60, getFloatParam(DEFL_PARAMS, "tempEndRect"));
			send_message(b);
			setWaitSensor(DS_CUB, getFloatParam(DEFL_PARAMS, "tempEndRect"));
		}

		//-- контроль
		t = getCubeTemp();
		if (t < getFloatParam(DEFL_PARAMS, "tempEndRect")) {
			break;
		}
		// Температура достигла отметки окончания ректификации

		//-- завершение
		set_status(PROC_WAITEND); // на охлаждение
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		DBG("Switch state to wait End of Rectification."); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_WAITEND:	// Отключение нагрева, подача воды для охлаждения

		#define END_OF_COOLDOWN_DELTA_T 6.0
		// старт
		if (prev_status!=MainStatus){
			setPower(0);		// Снятие мощности с тэна
			closeKlp(klp_glwhq); 	// Отключение клапана отбора голов/хвостов
			if (prev_status!=PROC_HV) { // если попали сюда не штатно, после отбора хвоста, а после рестарта то
				openKlp(klp_water);		// Открытие клапана воды
				closeKlp(klp_sr); 			// Отключение клапана продукта
			}
			else {
				sprintf(b, "%02d:%02d:%02d охлаждение", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
				send_message(b);
			}
			tempTube20Prev = getTube20Temp(); // фиксируем текущую T низа колонны
			secTempPrev = uptime_counter; // и текущее время
			prev_status=MainStatus;
			if (tempTube20Prev>0){
				LOG("PROC_COOLDOWN (till Ttube20:%5.1f)",tempTube20Prev-END_OF_COOLDOWN_DELTA_T);
				setWaitStr("снижение Tниза колонны на 6.0 С");
			}
			else {
				LOG("PROC_COOLDOWN (for 180 sec)");
				setWaitStr("180 сек");
			}
		}

		//  контроль завершения
		if (tempTube20Prev>0) { // датчик низа колонны исправен, контролируем завершение охлаждения по нему
			//ждем когда Тниза колонны снизится на заданное число градусов
			if (getTube20Temp() > (tempTube20Prev - END_OF_COOLDOWN_DELTA_T)) break;
		}
		else { // иначе контроль завершения по времени
			if ((uptime_counter - secTempPrev) < 180) break; //ждем 180 секунд
		}

		//  завершение
       	set_status(PROC_END);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true);
		break;

	case PROC_END:		// Окончание работы
		// старт
		if (prev_status!=MainStatus){
			setWaitStr("хозяина");
			LOG("END");
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
			SecondsEnd = uptime_counter;
			if (prev_status ==PROC_WAITEND){
				sprintf(b, "%02d:%02d:%02d ректификация завершена", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
				send_message(b);
			}
			prev_status=MainStatus;
			if (getIntParam(DEFL_PARAMS, "DIFFoffOnStop")) {
				xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
			}
		}
		//  контроль
		break;  // ничего не делаем

	default:
		break;		// Окончание работы
	}
}

// Обработка состояний в режиме дистилляции
void Distillation(void)
{
	float t, t_end;
	char b[80];
	static int16_t prev_status=START_WAIT;
	static float controlT;

