croghostrider/esp32_hd/main/hd_main.c
	switch (MainStatus) {
	case START_WAIT:
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			closeAllKlp();
			if (SetPower) setPower(0);
			setWaitStr("запуска");
		}
		// Ожидание запуска процесса
		break;

	case PROC_START:		// Начало процесса
		startPressure = bmpTruePressure; // Фиксация атм. давления.
		set_status(PROC_RAZGON); // @suppress("No break at end of case")
		/* fall through */

	case PROC_RAZGON:		// Разгон до рабочей температуры
		if (prev_status!=MainStatus){
			prev_status=MainStatus;
			closeAllKlp();
			set_proc_power("maxPower");
			sprintf(b, "%02d:%02d:%02d Distillation: разгон до %.2f", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60,getFloatParam(DEFL_PARAMS, "tEndDistRazgon"));
			send_message(b);
			setWaitSensor(DS_CUB, getFloatParam(DEFL_PARAMS, "tEndDistRazgon"));
		}

		t = getCubeTemp();
		if (sensor_err(t)){ // сбой датчика
			break;
		}

		if (t < getFloatParam(DEFL_PARAMS, "tEndDistRazgon")) break;
		// go to next
		set_status(PROC_DISTILL); // @suppress("No break at end of case")
		 /* fall through */

	case PROC_DISTILL:		// Процесс дистилляции
		t = getCubeTemp();
		t_end = getFloatParam(DEFL_PARAMS, "tEndDistil");
		if (prev_status!=MainStatus){
			openKlp(klp_water);
			openKlp(klp_sr);
			closeKlp(klp_glwhq);
			set_proc_power("powerDistil"); // Мощность дистилляции
			prev_status=MainStatus;
			if (t_end < 0){ // настроен отбор по времени
				secTempPrev = uptime_counter + (-(uint32_t)t_end*60); // фиксируем время завершения отбора
				setWaitTime("uptime %02d:%02d:%02d",secTempPrev);
			}
			else {
				setWaitSensor(DS_CUB, t_end);
			}

			sprintf(b, "%02d:%02d:%02d Distillation: тело до %.2f", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60,t_end);
			send_message(b);
		}

		if (t_end<0) {
			if (uptime_counter<secTempPrev) break; // ждем времени завершения
		}
		else {
			if (sensor_err(t)){ // сбой датчика
				break;
			}
			if (t < t_end) break; // ждем температуру завершения
		}
		//Завершение
		set_status(PROC_WAITEND);	 //@suppress("No break at end of case")
		//break;


	case PROC_WAITEND:	// Отключение нагрева, подача воды для охлаждения
#define DISTILL_COOLDOWN_DETLTA_T 1.0
		// старт
		if (prev_status!=MainStatus){
			setPower(0);		// Снятие мощности с тэна
			openKlp(klp_water);		// Открытие клапана воды
			closeKlp(klp_glwhq); 	    // Отключение клапана отбора голов/хвостов
			closeKlp(klp_sr); 			// Отключение клапана продукта
			controlT = getCubeTemp()-DISTILL_COOLDOWN_DETLTA_T; // фиксируем текущую T
			secTempPrev = uptime_counter; // и текущее время
			prev_status=MainStatus;
			if (controlT>0){
				LOG("PROC_COOLDOWN (till Tcube:%5.1f)",controlT);
				sprintf(b, "снижение Т куба до %.1f", controlT);
				setWaitStr(b);
				sprintf(b, "охлаждение Т куба до %.1f", controlT);
				send_message(b);
			}
			else {
				LOG("PROC_COOLDOWN (for 180 sec)");
				setWaitStr("180 сек");
				send_message("Distillation: 180 sec охлаждение");
			}
		}

		//  контроль завершения
		if (controlT>0) { // датчик исправен, контролируем завершение охлаждения по нему
			//ждем когда Т куба снизится до контрольной температуры
			if (getCubeTemp() > controlT) break;
		}
		else { // иначе контроль завершения по времени
			if ((uptime_counter - secTempPrev) < 180) break; //ждем 180 секунд
		}
		//  завершение
		set_status(PROC_END);
		sprintf(b, "%02d:%02d:%02d Distillation complete", uptime_counter/3600, (uptime_counter/60)%60, uptime_counter%60);
		send_message(b);
		if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(true); // @suppress("No break at end of case")
		//break;

	case PROC_END:
		// Окончание работы
		if (prev_status!=MainStatus){
			SecondsEnd = uptime_counter;
			prev_status=MainStatus;
			setPower(0);		// Снятие мощности с тэна
			closeAllKlp();		// Закрытие всех клапанов.
			if (getIntParam(DEFL_PARAMS, "DIFFoffOnStop")) {
				xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
			}
			setWaitStr("хозяина");
		}
		break;
	}
}

void procTask(void *arg){
	while (1) {
		if (MODE_RECTIFICATION == MainMode) Rectification();
		else if (MODE_DISTIL == MainMode) Distillation();
		vTaskDelay(1000/portTICK_PERIOD_MS);
	}
}

/*
 * send command (ON/OFF) to a specified valve
 */
void cmd2valve (int valve_num, valve_cmd_t cmd){
	static valveCMDmessage_t cmd_message;
	DBGV("v:%d cmd:%d",valve_num, cmd);
	if (valve_num>=MAX_KLP) {
		ERR_MSG("incorrect valve num %d", valve_num);
		return;
	}
	if (valve_cmd_queue){
		cmd_message.cmd = cmd;
		cmd_message.valve_num=valve_num;
		if (xQueueSend( valve_cmd_queue, ( void * ) &cmd_message, ( TickType_t ) 10 )!= pdPASS){
			ERR_MSG("timeout of cmd sending");
		}
	}
	else {
		ERR_MSG("CMD queue doesn't exist");
	}
}

/*
 * Закрытие всех клапанов.
 */
void closeAllKlp(void)
{
	for (int i=0; i<MAX_KLP; i++)	closeKlp(i);
}

/*
 * Открытие клапана с выключением программного ШИМ
 */
void openKlp(int i)
{
	cmd2valve(i, cmd_open);
	Klp[i].is_pwm = false;
}

/*
 * Закрытие клапана с выключением программного ШИМ
 */
inline void closeKlp(int i)
{
	cmd2valve (i, cmd_close);
	Klp[i].is_pwm = false;
}

/*
 * Запуск шима клапана
 */
void startKlpPwm(int i, float topen, float tclose)
{
	if (i>=MAX_KLP) return;
	DBGV( "PWM klp %d %.1f/%.1f", i, topen, tclose);
	Klp[i].open_time = topen;	// Время в течении которого клапан открыт
	Klp[i].close_time = tclose;	// Время в течении которого клапан закрыт
	Klp[i].is_pwm = true;	// Запускаем медленный Шим режим

	if (! Klp[i].pwm_task_Handle){
		xTaskCreate(valvePWMtask, "valvePWMtask", 8192, (void *)i, 5, &Klp[i].pwm_task_Handle);	//запускаем задачу программного ШИМ клапана
		vTaskDelay( 100/portTICK_PERIOD_MS );
	}
	else
		vTaskResume( Klp[i].pwm_task_Handle);
}

/* Запуск программного ШИМ с параметрами
* @клапан
* @период в сек
* @процент времени открытия
*/
void start_valve_PWMpercent(int valve_num, float period_sec, float percent_open){
	float topened= (period_sec*percent_open)/100.0;
	float tclosed=period_sec-topened;
	DBGV("id:%d per:%.1f pwm:%.1f open:%.1f close:%.1f",valve_num,period_sec, percent_open,topened,tclosed);
	if ((topened < 0)||(topened<0)||(period_sec==0)){
		DBGV("incorrect param,period %.1f open %.1f close %.1f", period_sec, topened, tclosed);
		return;
	}
	startKlpPwm(valve_num, topened, tclosed);
}

