croghostrider/esp32_hd/main/hd_main.c
	if (! getIntParam(DEFL_PARAMS, "no_power")){ //--- если используем регулятор-стабилизатор
		/* Настройка gpio детектора нуля сетевого напряжения */
		gpio_set_direction(GPIO_DETECT_ZERO, GPIO_MODE_INPUT);
		gpio_set_intr_type(GPIO_DETECT_ZERO, GPIO_INTR_NEGEDGE);
		gpio_set_pull_mode(GPIO_DETECT_ZERO, GPIO_PULLUP_ONLY);
	}

	if (getIntParam(DEFL_PARAMS, "useExernalAlarm")) {
		/* Настройка gpio внешнего аварийного детектора */
		gpio_set_direction(GPIO_ALARM, GPIO_MODE_INPUT);
		gpio_set_intr_type(GPIO_ALARM, GPIO_INTR_NEGEDGE);
		gpio_set_pull_mode(GPIO_ALARM, GPIO_PULLUP_ONLY);
	}

	/* Настройка прерываний */
	ESP_ERROR_CHECK(gpio_isr_register(gpio_isr_handler, NULL, ESP_INTR_FLAG_LEVEL2, NULL));

	// Configure output gpio
	io_conf.intr_type = GPIO_PIN_INTR_DISABLE;
	io_conf.mode = GPIO_MODE_OUTPUT;
	io_conf.pin_bit_mask = GPIO_OUTPUT_BEEPER;
	io_conf.pull_down_en = 0;
	io_conf.pull_up_en = 0;
	gpio_config(&io_conf);

	/* Запуск http сервера */
	hd_httpd_init();	

	/* Настройка таймера */
	tg0_timer0_init();

	/* Запуск отображения на дисплее */
	hd_display_init();

	//--- регулятор-стабилизатор
	if (! getIntParam(DEFL_PARAMS, "no_power")){ //--если его используем
		/* PZEM */
		xTaskCreate(&pzem_task, "pzem_task", 2048*4, NULL, 1, NULL);
		// ШИМ управления симистором
		ledc_timer_config_t ledc_timer = {
	#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
			.duty_resolution = LEDC_TIMER_10_BIT,
	#else
			.bit_num = LEDC_TIMER_10_BIT,
	#endif
			.freq_hz = TRIAC_CONTROL_LED_FREQ_HZ * 2,
			.speed_mode = LEDC_HIGH_SPEED_MODE,
			.timer_num = LEDC_TIMER_0
		};
		ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer));
	    ledc_channel_config_t ledc_channel = {
	            .gpio_num = GPIO_TRIAC,
	            .speed_mode = LEDC_HIGH_SPEED_MODE,
	            .channel = 0,
	            .timer_sel = LEDC_TIMER_0,
	            .duty = (1 << LEDC_TIMER_10_BIT) - 1,
	            .intr_type = LEDC_INTR_DISABLE
		};
		ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));

		LEDC.channel_group[0].channel[0].duty.duty = TRIAC_GATE_IMPULSE_CYCLES << 4;
	        // Initial brightness of 0, meaning turn TRIAC on at very end:
	    LEDC.channel_group[0].channel[0].conf0.sig_out_en = 0;
		LEDC.channel_group[0].channel[0].conf1.duty_start = 0;
	}

	// valves control
	valve_cmd_queue = xQueueCreate(10, sizeof(valveCMDmessage_t));			//---очередь команд открытия/закрытия клапанов
	if (! valve_cmd_queue){
		ERR_MSG("error of QUEUE creating!");
	}
	else {
		xTaskCreate(valveCMDtask, "valveCMDtask", 8192, NULL, 5, NULL);	//---задача включения/выключения клапанов по командам
	}

	/* задача контроля флагов тревоги, звук при аварии, выключения дифф-автомата*/
	xTaskCreate(&alarmControlTask, "alarmControl", 4096, NULL, 1, NULL);

	if (getIntParam(DEFL_PARAMS, "DIFFoffOnStart")) {// при настройке "выключать дифф при старте"
		xTaskCreate(&diffOffTask, "diff Off task", 4096, NULL, 1, NULL); // выключаем дифф
	}

	ESP_ERROR_CHECK(gpio_intr_enable(GPIO_DETECT_ZERO));
	DBG("Enabled zero crossing interrupt");

	if (getIntParam(DEFL_PARAMS, "useExernalAlarm")) {
		ESP_ERROR_CHECK(gpio_intr_enable(GPIO_ALARM));
	}

	restoreProcess();

	if (getIntParam(DEFL_PARAMS, "beepChangeState")) myBeep(false);

	xTaskCreate(&procTask, "proc scheduler", 4096*2, NULL, 1, NULL);

	while (true) {
		cJSON *ja = getInformation();
     		char *r=cJSON_Print(ja);
		cgiWebsockBroadcast("/ws", r, strlen(r), WEBSOCK_FLAG_NONE);
		cJSON_Delete(ja);
		if (r) free(r);
		vTaskDelay(wsPeriod*1000/portTICK_PERIOD_MS);
	}
}

void valveCMDtask(void *arg){
	valveCMDmessage_t qcmd;
	ledc_channel_t ch;
	TickType_t xLastWakeTime=0;
#ifdef DEBUGV
	TickType_t prevValveSwitch=0;
#endif

	water_duty_percent = 100;

	// LEDC
	ledc_timer_config_t ledc_timer1 = {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
		.duty_resolution = LEDC_TIMER_10_BIT,
#else
		.bit_num = LEDC_TIMER_10_BIT,
#endif
		.freq_hz = VALVES_CONTROL_LED_FREQ_HZ,
		.speed_mode = LEDC_HIGH_SPEED_MODE,
		.timer_num = LEDC_TIMER_1
	};
	ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer1));
	// Настройка клапанов управления
	for (int i=0; i<MAX_KLP; i++) {
		ledc_channel_config_t ledc_channel = {
			.gpio_num = klp_gpio[i],
			.speed_mode = LEDC_HIGH_SPEED_MODE,
			.channel = i+1,
			.timer_sel = LEDC_TIMER_1,
			.duty = 0,
			.intr_type = LEDC_INTR_DISABLE,
		};
		Klp[i].is_open = false;
		Klp[i].channel = i+1; // +1 т.к. нулевой канал зарезервирован под регулятор мощности
		Klp[i].pwm_task_Handle=NULL;
		ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));
		LEDC.channel_group[0].channel[i+1].conf0.sig_out_en = 0;
	}
	ledc_fade_func_install(0);

	while (1){
		if (xQueueReceive(valve_cmd_queue, &qcmd, portMAX_DELAY)==pdFALSE) // ждем события на открытие/закрытие клапана
			continue;																							// если таймаут - повторим
		ch = Klp[qcmd.valve_num].channel;															// ledc-канал  клапана
		LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 1;
		DBGV("v:%d(ch:%d) cmd:%d",qcmd.valve_num,ch,qcmd.cmd);
		switch (qcmd.cmd) {
			case cmd_open:
				xLastWakeTime = xTaskGetTickCount ();// системное время включения, в тиках
				Klp[qcmd.valve_num].is_open = true;
				int duty;


				if ((qcmd.valve_num == klp_water)&&(getIntParam(DEFL_PARAMS,"klp1_isPWM"))) {
					duty = water_duty_percent; // % ШИМ питания насоса
				}
				else {// % ШИМ удержания клапана
					 duty = getIntParam(DEFL_PARAMS,"klpKeepPWM");
				}
				duty = (VALVE_DUTY*duty +50)/100ul;
				// -------включение
				ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, VALVE_DUTY);
				ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);

	#ifdef DEBUGV
				DBGV(" ON:%d(%d ms)",qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS );
				prevValveSwitch=xLastWakeTime;
	#endif
				// ---------логика снижения тока клапана после его включения---------
				// ---не снижаем если
				if (
						(qcmd.valve_num == klp_diff)  || 			// это клапан4, выход на дифф-автомат
						(	(Klp[qcmd.valve_num].is_pwm)																//клапан в режиме программного ШИМ
							&&																										//и время его открытого состояния
							(KEEP_KLP_DELAY_MS >= (Klp[qcmd.valve_num].open_time*1000))			//меньше времени задержки до перехода на удержание
						)
					)
				{
					DBGV("pwm no decrease");
					break;
				}
				vTaskDelayUntil( &xLastWakeTime, KEEP_KLP_DELAY_MS/portTICK_PERIOD_MS );//ждем включения механики клапана
				ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, duty);
				ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
				DBGV("set duty:%d", duty);

				break;

