croghostrider/esp32_hd/main/hd_main.c
			case cmd_close:
				if (Klp[qcmd.valve_num].is_open){ // закрываем если открыт
#ifdef DEBUGV
					xLastWakeTime = xTaskGetTickCount ();
					DBGV("OFF:%d(%d ms)", qcmd.valve_num, (xLastWakeTime-prevValveSwitch)*portTICK_PERIOD_MS);
					prevValveSwitch =xLastWakeTime;
#endif
					ledc_set_duty(LEDC_HIGH_SPEED_MODE, ch, 0);
					ledc_update_duty(LEDC_HIGH_SPEED_MODE, ch);
					LEDC.channel_group[0].channel[ch].conf0.sig_out_en = 0;
					Klp[qcmd.valve_num].is_open = false;
				}
				else {
					DBGV("cmd close ignored");
				}
				break;
			default:
				break;
		}
	}
}

void setTimezone(int gmt_offset){
	char tz[10];
	snprintf(tz, 10, "CST-%d", gmt_offset);
	setenv("TZ", tz, 1);
	tzset();
}

void restoreProcess(void) {
	int16_t pw;
	if (!nvsHandle) {
		ERR_MSG("no NVS handle, process isn't restored");
		return;
	}
	nvs_get_i16(nvsHandle, "MainMode", (int16_t*)&MainMode);
	nvs_get_i16(nvsHandle, "SetPower", &pw);
	nvs_get_i16(nvsHandle, "MainStatus", &MainStatus);
	LOG_MSG("MMode:%d State:%d Power:%d",MainMode,MainStatus,pw);
	switch (MainMode) {
		case  MODE_RECTIFICATION:
		case  MODE_DISTIL:
			if ( (MainStatus>PROC_START) && (MainStatus<PROC_END)){
				broken_proc = true;
				nvs_get_u64(nvsHandle, "tempStabSR", (uint64_t*)&tempStabSR);
				nvs_get_u64(nvsHandle, "tempTube20Prev", (uint64_t*)&tempTube20Prev);
				nvs_get_i16(nvsHandle, "ProcChimSR", &ProcChimSR);
				LOG_MSG("broken proc=true  Tstab:%02.1f Tprev:%02.1f ProcPWM:%d",tempStabSR,tempTube20Prev,ProcChimSR);
			} // @suppress("No break at end of case")
		case  MODE_POWEERREG:
			  setPower(pw);
			  break;
		default:
			break;
	}
}

void setWaitStr(const char* s){
	strcpy(wait_str,s);
}

const char *getWaitStr(void){
	return (const char*)wait_str;
}

void setWaitSensor(DsType sensor, double temperature){
	char d[WAIT_STR_LEN];
	wait_sensor = sensor;
	wait_T = temperature;
	snprintf(d, sizeof(d)-1, "%s:%3.1f", getDsTypeStr(sensor), temperature);
	setWaitStr(d);
}

void 	setWaitTime(const char* s, uint32_t time){
	char buf[WAIT_STR_LEN];
	snprintf(buf, sizeof(buf)-1, s , (time/3600), (time/60)%60, time%60);
	setWaitStr(buf);
}

inline DsType getWaitSensor(void){
	return wait_sensor;
}

inline double getWaitT(void){
	return wait_T;
}

/* задать в процентах быстрый ШИМ для ключа управления клапаном/насосом воды
 *
 */
int setWaterPWM(int pwm_percent) {
	water_duty_percent = pwm_percent;
	if (pwm_percent>100) water_duty_percent = 100;
	if (pwm_percent<0) water_duty_percent = 0;
	openKlp(klp_water);
	return water_duty_percent;
}

cJSON* json_klp(int i){
	cJSON *jt = cJSON_CreateObject();
	float period=0;
	float percent = 0;

	if (i==klp_water) {
		if (Klp[i].is_open)	percent = water_duty_percent;
	}
	else {
		period =  (Klp[i].open_time+Klp[i].close_time);
		percent = 0;
		if (Klp[i].open_time>0) {
			float p = period/Klp[i].open_time;
			if (p) percent = roundX(100/p,2);
		}
	}
	cJSON_AddItemToObject(jt, "id", cJSON_CreateNumber(i));
	cJSON_AddItemToObject(jt, "is_pwm", cJSON_CreateNumber(Klp[i].is_pwm));
	cJSON_AddItemToObject(jt, "is_open", cJSON_CreateNumber(Klp[i].is_open));
	cJSON_AddItemToObject(jt, "pwm_time", cJSON_CreateNumber((int)period));
	cJSON_AddItemToObject(jt, "pwm_percent", cJSON_CreateNumber((int)(percent+0.5)));
	return jt;
}
